# verdict_pattern.py
# 用於臺灣法院判決字號擷取的正規表達式

from re import compile, VERBOSE, UNICODE, DOTALL

pattern = compile(r"""
(?P<court>
    最高法院 |
    (?:台|臺)?(?:高等|行政|軍事)法院(?:[\u4e00-\u9fa5]{0,3}分院)? |
    (?:臺灣)?(?:台|臺)?(?:北|新北|士林|宜蘭|桃園|新竹|苗栗|臺中|台中|彰化|
    南投|雲林|嘉義|臺南|台南|高雄|屏東|花蓮|臺東|台東|金門|澎湖)
    地方法院
)
[\s　]{0,10}?
(?P<year>[〇○零一二三四五六七八九十百千\d]{1,7})\s*年(?:度)?
[\s　]{0,10}?
(?P<word>
    [\u4e00-\u9fa5A-Za-z\d]{0,8}?
    (?:上|訴|重|簡|再|抗|聲|家|易|選|特|更)?
)
字第\s*
(?P<num>[〇○零一二三四五六七八九十百千\d]{1,6})
\s*號\s*
(?P<type>(?:民事|刑事|行政)?(?:判決|裁定|判例|決定))
""", VERBOSE | UNICODE | DOTALL)




